Autodesk.Revit.DB.Part.ResetFaceOffset(Autodesk.Revit.DB.Face)
Resets the offset applied to the given part face.
face:
The face whose offset needs to be reset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Part.GetFaceOffset(Autodesk.Revit.DB.Face)
Get face offset of the given part face.
face:
The face whose offset is required.
Returns:
Returns the value of the offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Part.SetFaceOffset(Autodesk.Revit.DB.Face,System.Double)
Offsets the given part face in the direction that points out of the solid shape with the specified amount.
Negative value will offset the face into the solid shape.
face:
The face to offset.
offset:
The magnitude of the offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
face does not belong to the part.
-or-
The face to be offset should be planar and satisfy constraints of its parent element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Part.CanOffsetFace(Autodesk.Revit.DB.Face)
Checks if it is possible to offset the given face.
face:
face to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Part.OriginalCategoryId
The category Id of the original element corresponding to this Part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: dPartOriginalCategoryId is not an available member of the original category ids of the elements which formed this Part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013